/* 
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */

                var chart = c3.generate({
                    bindto: '#chart',
                    data: {
                        x: 'x',
                        xFormat: '%Y-%m-%d %H:%M:%S',
                        columns: [
                            //↓DBから取得したデータを動的に格納
                            ['x', '2017-06-27 0:00:00', '2017-06-27 1:00:00', '2017-06-27 2:00:00', '2017-06-27 3:00:00', '2017-06-27 4:00:00', '2017-06-27 5:00:00', '2017-06-27 6:00:00', '2017-06-27 7:00:00', '2017-06-27 8:00:00', '2017-06-27 9:00:00', '2017-06-27 10:00:00', '2017-06-27 11:00:00', '2017-06-27 12:00:00', '2017-06-27 13:00:00', '2017-06-27 14:00:00', '2017-06-27 15:00:00', '2017-06-27 16:00:00', '2017-06-27 17:00:00', '2017-06-27 18:00:00', '2017-06-27 19:00:00', '2017-06-27 20:00:00', '2017-06-27 21:00:00', '2017-06-27 22:00:00'],
                            ['湿度の推移', 35.4, 100, 50.0, 70.2, 11.1, 25.6, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]
                        ]
                    },
                    axis: {
                        x: {
                            label: {
                                text: '日時',
                                position: 'outer-middle'
                            },
                            type: 'timeseries',
                            tick: {
                              format: '%d日%H時',
                              //↓各日0時のみ動的に格納
                              values: ['2017-06-27 0:00:00', '2017-06-28 0:00:00', '2017-06-29 0:00:00', '2017-06-30 0:00:00']
                            }
                        },
                        y: {
                            label: {
                                text: '湿度(%)',
                                position: 'outer-middle'
                            },
                            max: 100 //100%
                        }
                    }
                });